src/test/resources/test-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="alan">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>Kazakhstan</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>
